In [1]:
# Dependencies
# Create config.py file in Visual Studio Code
# Insert pg Admin4 username and password in config.py file
# Run pip install psycopg2 in terminal
# Run pip install psycopg2-binary in terminal

import pandas as pd
import matplotlib.pyplot as plt
from config import username, password
%matplotlib inline

# Create engine connection into database
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/sql_challenge')
connection = engine.connect()

In [2]:
# Records from employees table
employees = pd.read_sql('select * from employees', connection, parse_dates=['birth_date', 'hire_date'])

In [3]:
# Display Head
employees.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [4]:

employees.count()

emp_no          300024
emp_title_id    300024
birth_date      300024
first_name      300024
last_name       300024
sex             300024
hire_date       300024
dtype: int64

In [5]:
salary = pd.read_sql("SELECT * from salaries", connection)
salary.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [6]:
# Create a histogram to visualize the most common salary ranges for employees.

In [7]:
# Create a bar chart of average salary by title.